cask_args appdir: '/Applications'

tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# apps
cask 'notion'
cask 'zeplin'
cask 'spectacle'          # window management
cask 'whatsapp'

cask 'chromedriver'
cask 'google-chrome'
cask 'iterm2'
cask 'atom'
cask 'java'
cask 'insomnia'           # postman alternative
cask 'docker'

cask 'google-chrome'
cask 'firefox'
cask 'kap'
cask 'slack'
cask '1password'
cask 'visual-studio-code'

# Unix tools
brew 'coreutils'           # GNU file, shell and text utilities
brew 'gpg'                 # GNU privacy packages
brew 'openssl'
brew 'wget'

# dev tools
brew 'fzf'
brew 'thefuck'
brew 'tmux'
brew 'sqlite'
brew 'python'
brew 'git'
brew 'gh'
brew 'neovim'
brew 'zsh'
brew 'htop'
brew 'fd'
brew 'ansible'
brew 'jq'                        # format JSON
brew 'imagemagick'
brew 'shellcheck'
brew 'node'
brew 'openssl'



# postgres / postgis dependencies
brew 'postgresql'
brew 'geos'
brew 'proj'
brew 'gdal'
brew 'libxml2'
brew 'json-c'
